import { Sample } from "./Sample";

export const SampleSection: React.FC = () => {
  return (
    <section className="max-w-[1100px] mx-auto pt-32">
      <p className="lg:text-[40px] text-[28px] font-Dela text-center pb-16 px-4 rtl">
      مثال عملنا
      </p>
      <div className="w-full sm:max-w-[640] px-4 md:max-w-[768px] lg:max-w-[1024px] xl:max-w-[1280px] 2xl:mx-w-[1536px] mx-auto max-lg:text-center">
        <Sample
          title="نظارات الواقع الحقيقي"
          paragraph1='يعرض هذا المقطع فكرة &quot;توائم رقمية&quot; مرتبطة بالترقيم اعتمادًا على تكنولوجيا &quot;الاستجابة السريعة&quot; وواجهة الواقع
          المعزز (AR) واستخدامه لمساعدة وظيفة التركيب.'
          paragraph2="كل مكونات الغرض المجموعة هي مرقّمة برموز &quot;استجابة سريعة&quot;. تُستخدم هذه تقنية الترقيم لمساعدة المستخدم في
          التفريق بين أجزاء الغرض وفي عملية الاختيار."
          link="https://www.youtube.com/embed/2W3gtv_FznE"
        />
        <div className="mb-20 lg:mb-32" />
        <Sample
          title="تقنية الواقع المعزز المحمول"
          paragraph1="نستخدم أجهزة محمولة لدعم التعليم، التأسيس والحماية على جهاز معين عن بعد."
          paragraph2="يتم هذا الدعم عن طريق التطبيق المحمول الذي يتصل بشخص/عامل موجود في الصفحة شخصيًا مثلا: قاعة المصنع
          أو على الطبيعة. نستطيع بشكل واضح توسيع وتحسين التعاون بين متخصص ومستخدم غير متخصص باستخدام بث
          الفيديو مع توأم رقمي لدى جهاز مختار."
          link="https://www.youtube.com/embed/TprvKPtTz-o"
        />
        <p dir="rtl" className="lg:px-10 font-Lexend font-medium indent-6 pt-10 px-6">
        تستخدم البرامج المحمولة المقترحة ذات تعدّد المنصات (آي أو إس وأندرويد) واجهة الواقع المعزز لتطوير وازدياد
تحويل المعلومات بين المستخدمين بشكل ملحوظ. لذلك، سيكون ممكنًا ترميز الغرض الظاهر على الشاشة أو تثبيت
المعلومات الإضافية المختارة مثل استخدام فكرة &quot;توأم رقمي&quot; ونموذج ثلاثية الأبعاد لدى جهاز مصلّح مختلط مع
بيانات إضافية.
        </p>
        <p dir="rtl" className="lg:px-10 font-Lexend font-medium indent-6 pt-10 px-6">
        إضافًة إلى ذلك، يسمح تطبيقنا بإنشاء واحتفاظ بصورة شاشة لشاشة العمل خلال تواصل وعمل عن بعد وتأسيس
تقارير كاملة في تنفيذ التشخيصات عن بعد ودعم إجراءات الإصلاح. ذلك يشمل تعليقات المستخدمين وصورة الشاشة.
        </p>
      </div>
    </section>
  );
};
